# StairsActualNumberOfRisers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsActualNumberOfRisers Property
ParameterTypeId Class See Also
---
"Actual Number of Risers": The total number of actually created risers in model
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsActualNumberOfRisers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsActualNumberOfRisers As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsActualNumberOfRisers {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace